"""
Задача №16. 
Требуется вычислить, сколько раз встречается некоторое число k в массиве list_1.
Найдите количество и выведите его.
Пример:

list_1 = [1, 2, 3, 4, 5]
k = 3
# 1
"""

import os
os.system('cls')

list_1=[1, 2, 3, 4, 5,3]

k=3

res=list_1.count(k)

print(res)

